---
kind: type
id: T:Autodesk.Revit.DB.PartType
source: html/4182a378-a3cc-7f0c-87b3-d230c2540267.htm
---
# Autodesk.Revit.DB.PartType

An enumerated type listing all MEP family part types. A part type typically provides one unique set of type parameters that defines this part.

## Syntax (C#)
```csharp
public enum PartType
```